import UIKit

var str = "Hello, BASIC OPERATORS!"
//Язык Swift поддерживает большинство стандартных операторов C
// Оператор — это символ, который сообщает компилятору о необходимости выполнения некоторых математических или логических действий.
//Операторы делятся на унарные, бинарные и тернарные
//КЛАССИФИКАЦИЯ
//1. Оператор присваивания (a = b) инициализирует или изменяет значение переменной a на значение b
//2.Язык Swift поддерживает четыре стандартных арифметических оператора для всех числовых типов: сложение (+), вычитание (-), умножение (*), деление (/)
//3.Оператор целочисленного деления (a % b) показывает, какое количество b помещается внутри a, и возвращает остаток деления a на b.
//4.Язык Swift поддерживает все стандартные операторы сравнения из C: равно (a == b), не равно (a != b), больше (a > b), меньше (a < b), больше или равно (a >= b), меньше или равно (a <= b)
//5.Тернарный условный оператор — это специальный оператор из трех частей, имеющий следующий синтаксис: выражение ? действие1 : действие2.
//  Если выражение равно true, оператор выполняет действие1 и возвращает его результат; в противном случае оператор выполняет действие2 и возвращает его результат.
//6.Оператор замкнутого диапазона (a...b) задает диапазон от a до b, включая сами a и b. При этом значение a не должно превышать b.
//Оператор полузамкнутого диапазона (a..<b) задает диапазон от a до b, исключая значение b.
//7.Язык Swift, как и другие C-подобные языки, поддерживает три стандартных логических оператора: логическое НЕ (!a), логическое И (a && b), логическое ИЛИ (a || b)

